package myHomeWork1;

public class Task6 {
    /*
    Вывести на  экран все четные цифры от 1 до 100 не используя остаток
    от деления (используя только цикл for)
    */
    public static void main(String[] args) {
        for (int a = 2; a <= 100; a += 2) {
            System.out.println(a);
        }
    }
}
