package myHomeWork2;

public class Task3 {
    /*
    Write a Java program to print the following grid

    Напишите Java-программу для печати следующей сетки
    */
    public static void main(String[] args) {
        System.out.println("Данный таск выполнять не надо!");
    }
}
